// let arr = [ 'понедельник   ', 'вторник    ', 'среда    ', 'четверг    ', 'пятница   ', 'суббота   ', 'воскресенье   ' ] 
// alert( arr[0] + "u" + arr[4 ]+ " экзамен")



// arr = [ "женя ," ,"саша ," ,"миша ,"," дана   " , " вова  ," , "  получит ", "подарок  " , "не"]
// alert( arr[0] +  arr[3]+ " и" + arr[4] +  arr[5]  +  arr[6 ] )
// alert( arr[2 ]  +  arr[1 ] +  arr[7 ]  +  arr[5 ]  +  arr[6])





// obj = { "Женя" : " 20000" , " dana": " 40000" , "Bogdan" : "30000"}
// alert( obj["Bogdan"])



// arr = {
//     "женя" : [ "10000" , "15000" , " 20000"],
//     "саша" : [ "10000" , "15000" , "20000" , "30000"],
//  }
//  alert(arr ["саша"]  [3])




//  arr = { 

//     "девочки" : [ "нела" , "дана" ],
//     "мальчики" : [ "саша" , "вова" , "миша" , "женя"],
//  }
//  alert( arr ["девочки"] [1]   + arr  ["мальчики"] [0] + arr  ["мальчики"] [2] )
 

// let  a = 1
// let arr = [ 2 , 3 , 4 , 5]
// for (i = 0; i < 4 ; i++ ){
//     a = arr [i] * a }
//     alert(a)
 