// инкремент
// i++


// let i = 0
// while(i < 3 ){
// alert(i)
// console.log(i)
// i++
// }




// let i = 3
// while(i){
// alert(i)
// i--
// }



// let i = 0
// while(i <= 50){

// console.log(i)

// }


// let i = 0
// do{
//     alert(i)
//     i++
// }
// while(i < 3)


// let i = 0
// while(i < 101 ){

// console.log(i)
// i++

// }



// let i = 0
// for(  ; i < 3 ; ){
//     console.log(i)
// }




// let i = 0
// for(  ; i < 10 ; i++ ){

//         if(i % 2 == 0){
//             alert(i)
//         }
//     }




// let i = 3
// while(i){
//     alert(i--)
// }


// let i = 0
// for (i=0 ; i < 3 ; i++){
//     alert(i)
// }


// let i = 0
// while(i < 3){
//     alert(i)
//     i++}



// масив
// let arr =[]
// arr [0]=1
// arr [1]=2
// arr [2]=3
// alert( arr)














// let i = 0
// for (i = 0; i < 1000; i++) {
//     console.log(i)

//     if (i % 5 == 0) {
//         alert(i)
//     }
// }



// let i = prompt(" введите  день недели ")

// let arr = { 'пн': 'кр', ' vt', 'sr', 'zt', ' ptn', 'sub': 'кр', ' vs' };

// if (i = "пн") {
//     alert(" кр")
// } else if (i = "в какой день кр ?") {
//     alert(" в пн")
// } else {
//     alert(" свободный день")
// }















// var arr = ['Привет, ', 'мир', '!'];
// arr[0] = 'Пока, '; //перезапишем нулевой элемент массива
// alert(arr); //п





// let dni = { 'пн': 'в понедельник  кр', 'vt': 'нет', 'sr': 'нет', 'zt': 'нет', 'ptn': 'нет', 'sub': 'нет', 'vs': 'и в воскресенье кр' };
// alert(dni['пн']);
// alert(dni['vs']);










// ДЗ




let i = 0
for (i = 0; i < 1000; i++) {
    console.log(i)

    if (i % 5 == 0) {
        alert(i)
    }
}




// let arr = ['понедельник   ', 'вторник    ', 'среда    ', 'четверг    ', 'пятница   ', 'суббота   ', 'воскресенье   '];


// arr[0] = '  понедельник - кр    '
// arr[1] = '  вторник - нет кр    '
// arr[2] = '  среда - нет кр      '
// arr[3] = '  четверг - нет кр    '
// arr[4] = '  пятница  - нет кр   'arr = { 

//     "девочки" : [ "нела" , "дана" ],
//     "мальчики" : [ "саша" , "вова" , "миша" , "женя"],
//  }
//  alert( arr ["девочки"] [1]   + arr  ["мальчики"] [0] + arr  ["мальчики"] [2] )

// console.log(arr)

// let i = prompt("введите день недели или спросите когда у вас кр.")
// if (i == "понедельник") {
//     alert(" У вас  в " + arr[0])
// } else {
//     alert(" У вас в этот день нет кр ")
// }

// alert(arr)